%Список персонажей
персонаж('Дива').
персонаж('Думфист').	
персонаж('Королева').
персонаж('Мауга').
персонаж('Ориса').
персонаж('Рамматра').
персонаж('Райнхард').
персонаж('Турбосвин').
персонаж('Сигма').
персонаж('Винстон').
персонаж('Таран').
персонаж('Заря').
персонаж('Ана').
персонаж('Баптист').
персонаж('Бригитта').
персонаж('Илари').
персонаж('Юнона').
персонаж('Кирико').
персонаж('Ткач').
персонаж('Люсио').
персонаж('Ангел').
персонаж('Мойра').
персонаж('Дзенъятта').
персонаж('Эш').
персонаж('Бастион').
персонаж('Маккри').
персонаж('Эхо').
персонаж('Гендзи').
персонаж('Ханзо').
персонаж('Джанкрат').
персонаж('Мей').
персонаж('Фара').
персонаж('Жнец').
персонаж('Соджорн').
персонаж('Солдат').
персонаж('Сомбра').
персонаж('Симметра').
персонаж('Торбъёрн').
персонаж('Трейсер').
персонаж('Авентюра').
персонаж('Вдова').

%Список ролей
роль('Дива', 'танк').
роль('Думфист', 'танк').
роль('Королева', 'танк').
роль('Мауга', 'танк').
роль('Ориса', 'танк').
роль('Рамматра', 'танк').
роль('Райнхард', 'танк').
роль('Турбосвин', 'танк').
роль('Сигма', 'танк').
роль('Винстон', 'танк').
роль('Таран', 'танк').
роль('Заря', 'танк').
роль('Ана', 'поддержка').
роль('Баптист', 'поддержка').
роль('Бригитта', 'поддержка').
роль('Илари', 'поддержка').
роль('Юнона', 'поддержка').
роль('Кирико', 'поддержка').
роль('Ткач', 'поддержка').
роль('Люсио', 'поддержка').
роль('Ангел', 'поддержка').
роль('Мойра', 'поддержка').
роль('Дзенъятта', 'поддержка').
роль('Эш', 'урон').
роль('Бастион', 'урон').
роль('Маккри', 'урон').
роль('Эхо', 'урон').
роль('Гендзи', 'урон').
роль('Ханзо', 'урон').
роль('Джанкрат', 'урон').
роль('Мей', 'урон').
роль('Фара', 'урон').
роль('Жнец', 'урон').
роль('Соджорн', 'урон').
роль('Солдат', 'урон').
роль('Сомбра', 'урон').
роль('Симметра', 'урон').
роль('Торбъёрн', 'урон').
роль('Трейсер', 'урон').
роль('Авентюра', 'урон').
роль('Вдова', 'урон').

%Список уровней сложности
сложность('Дива','средняя').
сложность('Думфист','высокая').	
сложность('Королева','средняя').
сложность('Мауга','низкая').
сложность('Ориса','низкая').
сложность('Рамматра','средняя').
сложность('Райнхард','высокая').
сложность('Турбосвин','средняя').
сложность('Сигма','высокая').
сложность('Винстон','высокая').
сложность('Таран','высокая').
сложность('Заря','средняя').
сложность('Ана','высокая').
сложность('Баптист','средняя').
сложность('Бригитта','низкая').
сложность('Илари','средняя').
сложность('Юнона','низкая').
сложность('Кирико','средняя').
сложность('Ткач','низкая').
сложность('Люсио','высокая').
сложность('Ангел','низкая').
сложность('Мойра','низкая').
сложность('Дзенъятта','средняя').
сложность('Эш','средняя').
сложность('Бастион','низкая').
сложность('Маккри','средняя').
сложность('Эхо','высокая').
сложность('Гендзи','высокая').
сложность('Ханзо','средняя').
сложность('Джанкрат','низкая').
сложность('Мей','средняя').
сложность('Фара','средняя').
сложность('Жнец','низкая').
сложность('Соджорн','высокая').
сложность('Солдат','низкая').
сложность('Сомбра','высокая').
сложность('Симметра','средняя').
сложность('Торбъёрн','низкая').
сложность('Трейсер','высокая').
сложность('Авентюра','средняя').
сложность('Вдова','средняя').

%Список уровней актуальности
актуальность('Дива','высокая').
актуальность('Думфист','средняя').	
актуальность('Королева','средняя').
актуальность('Мауга','низкая').
актуальность('Ориса','низкая').
актуальность('Рамматра','средняя').
актуальность('Райнхард','низкая').
актуальность('Турбосвин','низкая').
актуальность('Сигма','средняя').
актуальность('Винстон','высокая').
актуальность('Таран','низкая').
актуальность('Заря','низкая').
актуальность('Ана','средняя').
актуальность('Баптист','средняя').
актуальность('Бригитта','средняя').
актуальность('Илари','средняя').
актуальность('Юнона','высокая').
актуальность('Кирико','средняя').
актуальность('Ткач','низкая').
актуальность('Люсио','средняя').
актуальность('Ангел','низкая').
актуальность('Мойра','низкая').
актуальность('Дзенъятта','средняя').
актуальность('Эш','высокая').
актуальность('Бастион','низкая').
актуальность('Маккри','высокая').
актуальность('Эхо','средняя').
актуальность('Гендзи','низкая').
актуальность('Ханзо','низкая').
актуальность('Джанкрат','низкая').
актуальность('Мей','средняя').
актуальность('Фара','низкая').
актуальность('Жнец','средняя').
актуальность('Соджорн','низкая').
актуальность('Солдат','низкая').
актуальность('Сомбра','низкая').
актуальность('Симметра','низкая').
актуальность('Торбъёрн','средняя').
актуальность('Трейсер','высокая').
актуальность('Авентюра','низкая').
актуальность('Вдова','низкая').

%Список внутриигровых организаций и их участников
организация('Овервотч', ["Дива","Райнхард","Винстон","Заря","Баптист","Овервотч","Маккри","Эхо","Гендзи","Мей","Фара","Соджорн","Трейсер","Люсио","Ангел", "Бригитта"]).
организация('Коготь', ["Думфист", "Жнец","Мойра","Вдова","Сомбра","Сигма","Мауга"]).
организация('Банда мертвецов', ["Эш"]).
организация('Вишкар', ["Симметра"]).
организация('Мусорщики', ["Королева","Турбосвин","Джанкрат","Таран"]).
организация('Нуль-сектор', ["Рамматра"]).
организация('Нейтральный', ["Ориса","Ана","Бастион","Ханзо","Солдат","Торбъёрн","Авентюра","Илари","Юнона","Кирико","Ткач","Дзенъятта"]).